app/controllers/scores_controller.rb

SELECT "scores".* FROM "scores" ORDER BY "scores"."id" DESC
---
  def index
  # .order(id:"DESC")で最新の投稿を上に表示させる
    @scores = Score.all.order(id: "DESC")

SELECT  "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @score = Score.find(params[:id])
    @user = User.find_by(id: @score.user_id)

SELECT  "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "scores" ("tittle", "key", "chord", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["tittle", "New"], ["key", "C"], ["chord", "C D"], ["created_at", "2019-07-29 16:19:34.133579"], ["updated_at", "2019-07-29 16:19:34.133579"], ["user_id", 1]]
---
  def create
    @score = Score.new(score_params)
    @score.user = current_user
    user = User.find_by_id(params[:id])

    @current_user ||= User.find_by(id: session[:user_id])


    respond_to do |format|
      if @score.save

UPDATE "scores" SET "tittle" = ?, "updated_at" = ? WHERE "scores"."id" = ?  [["tittle", "lemon サビ"], ["updated_at", "2019-07-30 21:34:35.559214"], ["id", 10]]
---
  def update
    respond_to do |format|
      if @score.update(score_params)

DELETE FROM "scores" WHERE "scores"."id" = ?  [["id", 7]]
---
  def destroy
    @score.destroy

SELECT  "scores".* FROM "scores" WHERE "scores"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_score
      @score = Score.find(params[:id])